{
  "id": 1,
  "email": "client1@gmail.com",
  "role": "CLIENT",
  "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJjbGllbnQxQGdtYWlsLmNvbSIsImlhdCI6MTczODg3Mjg4MCwiZXhwIjoxNzQxNTUxMjgwfQ.C3fGEtovlSOq3XQIla5qU2qH6xH8b8jFEjO7o_vAIzM",
  "favouriteBooks": [
    {
      "id": 1,
      "name": "The Hunger Games",
      "description": "Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.",
      "publicationYear": 2008,
      "authors": [
        {
          "fullName": "Suzanne Collins"
        }
      ],
      "genres": [
        {
          "name": "fiction"
        },
        {
          "name": "fantasy"
        },
        {
          "name": "science fiction"
        }
      ]
    },
    {
      "id": 3,
      "name": "The Complete Novels",
      "description": "Few novelists have conveyed the subtleties and nuances of their own social milieu with the wit and insight of Jane Austen. Through her vivacious and spirited heroines and their circle, she paints vivid portraits of English middle-class life as the eighteenth century came to a close. Each of the novels is a love story and a story about marriage — marriage for love, for financial security, for social status. But they are not mere romances; ironic, comic and wise, they are masterly studies of the society Jane Austen observed. The seven novels in this volume contain some of the most brilliant, dazzling prose in the English language.",
      "publicationYear": 1981,
      "authors": [
        {
          "fullName": "Jane Austen"
        }
      ],
      "genres": [
        {
          "name": "classic"
        },
        {
          "name": "fiction"
        },
        {
          "name": "romance"
        },
        {
          "name": "historical"
        }
      ]
    }
  ]
}